# функции с параметрами

lesson = 1154853

## Функции с параметрами

### Содержание

1. Аргументы функций
2. Параметры функции. Время жизни параметра.
3. `print(x, y, sep='', end=' ')` - параметры `sep` и `end`.

Сила функций в том, что один и тот же код они могут исполнять с разными начальными значениями.

Возьмем функцию, которая печатает подпись к письму

```python
def signature():
    print('С уважением, преподаватель кафедры КИВМ МФТИ.')
```
Замечательно, но каждый преподаватель хочет, чтобы эта функция печатала именно его фамилию. Что делать? Передадим фамилию в аргументах и напечатаем её.

```python
def signature(name):
    print(f'С уважением, {name}, преподаватель кафедры КИВМ МФТИ.')
    
# вызовем её с разными аргументами
signature('Дербышева Т.Н.')
signature('Овсянникова Т.В.')
signature('Хирьянов Т.Ф.')
```
Напечатает:
```python
С уважением, Дербышева Т.Н., преподаватель кафедры КИВМ МФТИ.
С уважением, Овсянникова Т.В., преподаватель кафедры КИВМ МФТИ.
С уважением, Хирьянов Т.Ф., преподаватель кафедры КИВМ МФТИ.
```

### Как это работает?

1. Программа начинает выполняться с первой строки. Создается объект - функция `signature`.
2. При вызове функции `signature('Дербышева Т.Н.')` управление передается в функцию `signature` (как и раньше).
3. **Создается переменная** `name`, в нее записывается значение при данном вызове функции, то есть строка `'Дербышева Т.Н.'`
4. Выполняется код тела функции (как и раньше).
5. **Переменная `name` уничтожается**.
6. Выходим из функции, управление передается в место после вызова, то есть у нас на следующий вызов функции `signature('Овсянникова Т.В.')`.
7. Далее пункты 2-7 повторяются. Но создается уже другая переменная с тем же именем `name` и в нее записывается другое значение - строка `'Овсянникова Т.В.'`. Так же при выходе из функции переменная разрушается.

Переменная, которую мы пишем в заголовке в скобках при определении функции называется **параметром** функции. У функции `signature` есть единственный параметр `name`.

Термины:

* **аргумент** - значение, которое передается в функцию, например, `'Овсянникова Т.В.'`.
* **параметр** - переменная, в которую записывается аргумент, например `name`.

Пока можете считать, что **один аргумент записывается в один параметр**. При изучении коллекций мы узнаем, что иногда много аргументов записывается в один параметр.

### Много параметров

Параметров в функции может быть много. Параметры пишут через `,`.

Умеем передавать несколько аргументов в функцию:
```python
print(23, 'hello', 3.14)    # функции print переданы три аргумента
```
Определили функцию с двумя параметрами `name` и `group`.

```python
def hi(name, group):
    print(f'Здравствуй, {name}, студент группы {group}')
    
print('Как тебя зовут?')
student_name = input()
print('В какой группе ты учишься?')
student_group = input()

hi(student_name, student_group)
```

* В функции `hi` параметры `name` и `group`.
* При вызове `hi(student_name, student_group)` аргументы - **значения** переменных `student_name` и `student_group`.
* Специально в примере разные имена переменных и параметров, чтобы вы не думали, что это одинаковые переменные. В программе 4 переменных. Две определены глобально, вне функций. Это `student_name` и `student_group`. Две - параметры функции `name` и `group`.


## SKIP Соответствие Что запишут в переменные?

Чему будет равно значение переменных `a`, `b` и `c` при данном вызове функции?

```python
def foo(x, y, z):
    print(f'x={x} y={y} z={z}')
    
foo(100, 9.5, -34)
```

## STRING единицы и остальное

Что будет напечатано?

```python
def ones(x):
    last = x % 10
    other = x // 10
    print(last, other)
    
ones(123)
```
Не забудьте ввести пробел между числами!

ANSWER: 3 12

## Пропуски присвоить

Что будет напечатано?

```python
def foo(a, b):
    a = a + b
    b = 12
    print(f'a={a} b={b}')
    
x = 5
y = 4
foo(x, y)
print(f'x={x} y={y}')
```
a=9 b=12
x=5 y=4

## sep и end

У функции **print** есть есть параметр **sep**. Он определяет, что будет напечатано между аргументами.

```python
print(1, 2, 3, sep=',')
```
напечатает аргументы через `,`:
```python
1,2,3
```
Заметим, пробел в этом случает не ставится. По умолчанию `sep=' '`, поэтому печатаются аргументы через пробел.

Параметр **end** определяет, что будет напечатано в конце последовательности. По умолчанию стоит перевод на новую строку.

```python
print(1, end='')
print(2)
print(3, 4, end='hello')
print(5)
```
напечатает
```python
12
3 4hello5
```
Можно указать одновременно `sep` и `end` (в любом порядке после данных, которые нужно напечатать):
```python
print(1, 2, 3, sep='-*-', end='!!!')
```
напечатает
```python
1-*-2-*-3!!!
```

## STRING sep-1

Что напечатает?

```python
print(31, 12, 2023, sep='.')
```

ANSWER: 31.12.2023

## STRING end-2

Что напечатает?
```python
print('Hello', end=' :)')
```

ANSWER: Hello :)

## STRING sep и end - 3

Что напечатает?
```python
print(10, 3, 1, sep='-', end='=')
```

ANSWER: 10-3-1=

## TASKINLINE Число наоборот

Реализуйте функцию `reverse(n)`, которая **печатает** **шестизначное** число `n` в обратном порядке. 

С помощью этой функции напечатайте наоборот три числа. Гарантируется, что ни одно число не заканчивается на 0.

TEST
123456
871123
961234
------
654321
321178
432169
======
110011
232323
456456
------
110011
323232
654654
======